from telebot.types import KeyboardButton, InlineKeyboardButton

text01 = {
    "actions": "Сиз рўйхатдан ўтишингиз керак \n"
               "Қуйидаги тугмани босинг",
    "caruz": f"Салом! \n"
             "Мен сизнинг машинангизга техник хизмат кўрсатиш ва таъмирлаш учун ботман\n"
             "компаниядан: \n"
             "TOTAL автосервис и студии Детейлинга Car-Driver.  \n"
             "\n"
             "Мен сизга ҳисоб-китоб қилишда ёрдам бераман ва сизга бепул маслаҳат ёки ташхис қўяман. \n"
             "\n"
             "Жавоб хабарида сизнинг сўровингизга мос келадиган тугмани босинг ",
    "text1": "Рўйхатдан ўтиш",
    "text2": "Исмингизни юборинг",
    "text3": "Super!",
    "text4": "Енди telefon рақамингизни шу шаклга ёзинг 998XXXXXXXXX\n"
             "Ёки тугмани босинг⬇️",
    "text5": "Ажойиб",
    "text6": "Сиз рўйхатдан ўтдингиз",
    "text7": "Тўғри емас,\n"
             "Қайта рўйхатдан ўтинг",
    "text8": "1. Сиз бизнинг менежеримизга тг-да ёзишингиз мумкин  ⬇️\n"
             "@Sdovi_money ✍️\n"
             "\n"
             "2 . Ёки рақамга қўнғироқ қилинг\n"
             "<b>+998 90 085 61 99</b> ☎️",
    "text9": "<b>Танланган хизмат нархини билмоқчимисиз?</b> \n"
             "<b>Қуйидаги тугмани босинг.</b>",
    "text10": "<b>Адрес филиал ТЛЗ:</b> \n"
              "\n"
              "г. Ташкент, Мирзо- Улугбекский р-н, ул. Саллар Буйи, дом 4 \n"
              "(напротив АЗС UZBEKNEFTEGAZ)\n"
              "<b>биза GOOGLE Картада:</b>\n"
              "https://maps.app.goo.gl/DpeKKcXjCTviJs4T8\n"
              "\n"
              "❇️   ❇️   ❇️   ❇️   ❇️   ❇️   ❇️\n"
              "\n"
              "<b>Адрес филиал Пойтахт:</b>\n"
              "\n"
              "г. Ташкент, Яшнабадский р-н, ул. Корасу, дом 28 (АЗС SUN \n"
              "PETROL-POYTAXT)\n"
              "<b>биза GOOGLE Картада</b>:\n"
              "https://maps.app.goo.gl/DgH9tQHwfwEMhyfv6 \n"
              "\n"
              "❇️   ❇️   ❇️   ❇️   ❇️   ❇️   ❇️\n"
              "\n"
              "<b>Биз ҳар куни 9.00 дан 19.00 гача ишлаймиз</b>\n"
              "\n"
              "<b>Контактный телефон: </b>\n"
              "\n"
              "☎️ +998977239449 <b>ТЛЗ</b>\n"
              "☎️ +998930029449 <b>ПОЙТАХТ</b>\n"
              "\n"
              "🌐 www.car-driver.uz",
    "text11": "<b>Автомобилингиз синфини танланг</b>",
    "text12": "Отлично",
    "text13": "Отлично",
    "text14": "Отлично",
    "text15": "Отлично",

}

btn1 = {
    "btn1": KeyboardButton(text="рўйхатдан ўтиш"),
    "btn3": KeyboardButton(text='Рақамни юборинг', request_contact=True),

    "btn_inl_4": InlineKeyboardButton(text='1️⃣ - Express Полировка кузова', callback_data="4"),
    "btn_inl_5": InlineKeyboardButton(text='2️⃣ - Detailing Полировка', callback_data="5"),
    "btn_inl_6": InlineKeyboardButton(text='3️⃣ - Жидкое стекло', callback_data="6"),
    "btn_inl_7": InlineKeyboardButton(text='1️⃣ - группа A-B-C класс', callback_data="7"),
    "btn_inl_8": InlineKeyboardButton(text='2️⃣ - группа D-E класс', callback_data="8"),
    "btn_inl_9": InlineKeyboardButton(text='3️⃣ - группа F-S-S+-J класс', callback_data="9"),
    "btn_inl_10": InlineKeyboardButton(text='орқага', callback_data="10"),

}

inline_btn1 = {
    "btn_inline_1": InlineKeyboardButton(text='Связь с менеджером.', callback_data="1"),
    "btn_inline_2": InlineKeyboardButton(text='Список детейлинг услуг', callback_data="2"),
    "btn_inline_3": InlineKeyboardButton(text='Наши контакты и локации', callback_data="3"),
}

actions1 = {
}
